04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/propeller/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            solidBody;

    libs            ("libpointMeshMovers.so");

    cellZone        innerCylinder;

    solidBodyMotionFunction
    {
        type            rotatingMotion;

        origin          (0 0 0);
        axis            (0 1 0);

        omega           1500 [rpm];
    }
}


// ************************************************************************* //
